zhangfei0312/HC32F401_ProjectDemo/LowPower/Libraries/FWlib/inc/hc32f4xx_tim.h
#ifndef __HC32F4xx_TIM_H
#define __HC32F4xx_TIM_H

#ifdef __cplusplus
 extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/
#include "hc32f4xx.h"


#define  TIM_CCMR1_OC1M_MASK                  ((uint32_t)0x00010070)  //OCxM & OCxMH
#define  TIM_CCMR1_OC2M_MASK                  ((uint32_t)0x01007000)	//OCxM & OCxMH
#define  TIM_CCMR2_OC3M_MASK                  ((uint32_t)0x00010070)	//OCxM & OCxMH
#define  TIM_CCMR2_OC4M_MASK                  ((uint32_t)0x01007000)	//OCxM & OCxMH



typedef struct
{
  uint16_t TIM_Prescaler; 
  uint16_t TIM_CounterMode;
  uint32_t TIM_Period;
  uint16_t TIM_ClockDivision;
  uint8_t  TIM_RepetitionCounter;  /*!< This parameter is valid only for TIM1 and TIM8. */
} TIM_TimeBaseInitTypeDef; 


/** 
  * @brief  TIM Output Compare Init structure definition  
  */

typedef struct
{
  uint32_t TIM_OCMode;
  uint16_t TIM_OutputState;
  uint16_t TIM_OCPolarity;
	uint16_t TIM_OCIdleState;
  uint32_t TIM_Pulse;
  uint16_t TIM_OutputNState;  /* This parameter is valid only for TIM1 and TIM8. */
  uint16_t TIM_OCNPolarity;  	/* This parameter is valid only for TIM1 and TIM8. */
  uint16_t TIM_OCNIdleState;  /* This parameter is valid only for TIM1 and TIM8. */
} TIM_OCInitTypeDef;


/** 
  * @brief  TIM Input Capture Init structure definition  
  */
typedef struct
{

  uint16_t TIM_Channel;
  uint16_t TIM_ICPolarity;
  uint16_t TIM_ICSelection;
  uint16_t TIM_ICPrescaler; 
  uint16_t TIM_ICFilter;
} TIM_ICInitTypeDef;

/** 
  * @brief  BDTR structure definition 
  * @note   This structure is used only with TIM1 and TIM8.    
  */

typedef struct
{

  uint16_t TIM_OSSRState;
  uint16_t TIM_OSSIState; 
  uint16_t TIM_LOCKLevel; 
  uint16_t TIM_DeadTime;   
  uint16_t TIM_Break;     
  uint16_t TIM_BreakPolarity; 
  uint16_t TIM_AutomaticOutput;
} TIM_BDTRInitTypeDef;



/** @defgroup TIM_OCMode 
  * @{
  */
#define TIM_OCMode_Timing                  ((uint32_t)0x00000000)
#define TIM_OCMode_Active                  ((uint32_t)0x00000010)
#define TIM_OCMode_Inactive                ((uint32_t)0x00000020)
#define TIM_OCMode_Toggle                  ((uint32_t)0x00000030)
#define TIM_OCMode_PWM1                    ((uint32_t)0x00000060)
#define TIM_OCMode_PWM2                    ((uint32_t)0x00000070)
#define TIM_OCMode_OPM1                    ((uint32_t)0x00010000)
#define TIM_OCMode_OPM2                    ((uint32_t)0x00010010)
#define TIM_OCMode_CPWM1                   ((uint32_t)0x00010040)
#define TIM_OCMode_CPWM2                   ((uint32_t)0x00010050)
#define TIM_OCMode_APWM1                   ((uint32_t)0x00010060)
#define TIM_OCMode_APWM2                   ((uint32_t)0x00010070)



/** @defgroup TIM_One_Pulse_Mode 
  * @{
  */

#define TIM_OPMode_Single                  ((uint16_t)0x0008)
#define TIM_OPMode_Repetitive              ((uint16_t)0x0000)



/** @defgroup TIM_Channel 
  * @{
  */
#define TIM_Channel_1                      ((uint16_t)0x0000)
#define TIM_Channel_2                      ((uint16_t)0x0004)
#define TIM_Channel_3                      ((uint16_t)0x0008)
#define TIM_Channel_4                      ((uint16_t)0x000C)
                                 

/** @defgroup TIM_Clock_Division_CKD 
  * @{
  */

#define TIM_CKD_DIV1                       ((uint16_t)0x0000)
#define TIM_CKD_DIV2                       ((uint16_t)0x0100)
#define TIM_CKD_DIV4                       ((uint16_t)0x0200)


/** @defgroup TIM_Counter_Mode 
  * @{
  */

#define TIM_CounterMode_Up                 ((uint16_t)0x0000)
#define TIM_CounterMode_Down               ((uint16_t)0x0010)
#define TIM_CounterMode_CenterAligned1     ((uint16_t)0x0020)
#define TIM_CounterMode_CenterAligned2     ((uint16_t)0x0040)
#define TIM_CounterMode_CenterAligned3     ((uint16_t)0x0060)

/** @defgroup TIM_Output_Compare_Polarity 
  * @{
  */

#define TIM_OCPolarity_High                ((uint16_t)0x0000)
#define TIM_OCPolarity_Low                 ((uint16_t)0x0002)


/** @defgroup TIM_Output_Compare_N_Polarity 
  * @{
  */
  
#define TIM_OCNPolarity_High               ((uint16_t)0x0000)
#define TIM_OCNPolarity_Low                ((uint16_t)0x0008)


/** @defgroup TIM_Output_Compare_State 
  * @{
  */

#define TIM_OutputState_Disable            ((uint16_t)0x0000)
#define TIM_OutputState_Enable             ((uint16_t)0x0001)


/** @defgroup TIM_Output_Compare_N_State
  * @{
  */
#define TIM_OutputNState_Disable           ((uint16_t)0x0000)
#define TIM_OutputNState_Enable            ((uint16_t)0x0004)


/** @defgroup TIM_Capture_Compare_State
  * @{
  */

#define TIM_CCx_Enable                      ((uint16_t)0x0001)
#define TIM_CCx_Disable                     ((uint16_t)0x0000)


/** @defgroup TIM_Capture_Compare_N_State
  * @{
  */
#define TIM_CCxN_Enable                     ((uint16_t)0x0004)
#define TIM_CCxN_Disable                    ((uint16_t)0x0000)
 

/** @defgroup TIM_Break_Input_enable_disable 
  * @{
  */
#define TIM_Break_Enable                   ((uint16_t)0x1000)
#define TIM_Break_Disable                  ((uint16_t)0x0000)


/** @defgroup TIM_Break_Polarity 
  * @{
  */
#define TIM_BreakPolarity_Low              ((uint16_t)0x0000)
#define TIM_BreakPolarity_High             ((uint16_t)0x2000)


/** @defgroup TIM_AOE_Bit_Set_Reset 
  * @{
  */

#define TIM_AutomaticOutput_Enable         ((uint16_t)0x4000)
#define TIM_AutomaticOutput_Disable        ((uint16_t)0x0000)


/** @defgroup TIM_Lock_level
  * @{
  */

#define TIM_LOCKLevel_OFF                  ((uint16_t)0x0000)
#define TIM_LOCKLevel_1                    ((uint16_t)0x0100)
#define TIM_LOCKLevel_2                    ((uint16_t)0x0200)
#define TIM_LOCKLevel_3                    ((uint16_t)0x0300)


/** @defgroup TIM_OSSI_Off_State_Selection_for_Idle_mode_state 
  * @{
  */

#define TIM_OSSIState_Enable               ((uint16_t)0x0400)
#define TIM_OSSIState_Disable              ((uint16_t)0x0000)


/** @defgroup TIM_OSSR_Off_State_Selection_for_Run_mode_state
  * @{
  */

#define TIM_OSSRState_Enable               ((uint16_t)0x0800)
#define TIM_OSSRState_Disable              ((uint16_t)0x0000)


